import { Film } from '../types/film.ts';
const film: { docs: Film[] } = {
  docs: [
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
    {
      id: 5275429,
      name: 'Лёд 3',
      year: 2024,
      description:
        'Надя выросла и стала фигуристкой. Она мечтает о «Кубке Льда», как когда-то мечтала ее мама. Горин возражает против спортивной карьеры дочери — он оберегает ее от любых трудностей и его можно понять: он потерял слишком много. На тайной тренировке Надя знакомится с молодым и дерзким хоккеистом из Москвы, и между ними вспыхивает первая любовь. Отец не верит в искренность чувств юноши и разлучает пару.\nНо препятствия только укрепляют настоящую любовь, а когда любишь — самый сказочный финал может стать реальностью.',
      rating: {
        kp: 8.244,
      },
      poster: {
        url: 'https://image.openmoviedb.com/kinopoisk-images/10671298/5d4e5068-4902-4dd3-a318-c13272de7134/orig',
      },
      backdrop: {
        url: 'https://image.openmoviedb.com/kinopoisk-ott-images/1652588/2a0000018eadd38f83d1618858084599c213/orig',
      },
      genres: [
        {
          name: 'мелодрама',
        },
      ],
    },
  ],
};

export default film;
